# Выводим меню
print("1 - Цельсий в Фаренгейт")
print("2 - Фаренгейт в Цельсий")

# Запрашиваем выбор
choice = int(input("Выберите операцию: "))

# Вводим температуру
temperature = float(input("Введите температуру: "))

# Если выбран первый вариант
if choice == 1:
    result = temperature * 9 / 5 + 32
    print("Температура в Фаренгейтах:", result)

# Если выбран второй вариант
elif choice == 2:
    result = (temperature - 32) * 5 / 9
    print("Температура в Цельсиях:", result)

# Если введён неправильный вариант
else:
    print("Ошибка: выберите 1 или 2")